In [1]:
import pandas as pd
from sqlalchemy import create_engine

### City

In [29]:
city_file = "data/city_attributes.csv"
city_data_df = pd.read_csv(city_file)
city_data_df.head()

            City        Country   Latitude   Longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

In [30]:
 # Create a filtered dataframe from specific columns
city_mapping_cols = ['City', 'Country', 'Latitude','Longitude']
city_transformed= city_data_df[city_mapping_cols].copy()

# Rename the column headers
city_transformed = city_transformed.rename(columns={'City':'city', 'Country':'country', 'Latitude':'latitude','Longitude':'longitude'})

# city_transformed.set_index("city",inplace=True)
city_transformed.head()

            city        country   latitude   longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

### Temperature

In [19]:
#Load and Read Files
temp_file = "data/temperature_pivot.csv"
temp_data_df = pd.read_csv(temp_file)
temp_data_df.head()

   Year       datetime           city  temperature
0  2016  1/1/2016 0:00      Vancouver   272.240000
1  2016  1/1/2016 0:00       Portland   275.593577
2  2016  1/1/2016 0:00  San Francisco   282.975494
3  2016  1/1/2016 0:00        Seattle   276.846559
4  2016  1/1/2016 0:00    Los Angeles   289.078882

In [24]:
#Map Column Names
temp_df = temp_data_df[["Year", "datetime", "city", "temperature"]]
temp_col_mapping = {"Year": "year", 
                  "datetime": "datetime",
                  "city": "city",
                  "temperature": "temperature"}
temp_df = temp_df.rename(columns=temp_col_mapping)

In [25]:
#Convert Kalvin to Fahrenheit
temperature_f = (temp_df["temperature"]-273.15)*9/5 + 32
temp_df["temperature"] = temperature_f
temp_df.head()

temperature_datetime=temperature_f[]

   year       datetime           city  temperature
0  2016  1/1/2016 0:00      Vancouver    30.362000
1  2016  1/1/2016 0:00       Portland    36.398438
2  2016  1/1/2016 0:00  San Francisco    49.685890
3  2016  1/1/2016 0:00        Seattle    38.653806
4  2016  1/1/2016 0:00    Los Angeles    60.671988

In [26]:
# Create Database Connection
rds_connection_string = "postgres:2344face@localhost:5432/etl"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [27]:
# Confirm tables
engine.table_names()

['premise',
 'county',
 'city',
 'humidity',
 'pressure',
 'temperature',
 'description',
 'wind_direction',
 'wind_speed']

In [31]:
city_transformed.to_sql(name='city', con=engine, if_exists='append', index=False)

In [32]:
temp_df.to_sql(name='temperature', con=engine, if_exists='append', index=False)